// Зарплата.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

int main()
{
    int a;
    int b;
    int c;
    int diff;
    int average;

    std::cout << "Введите зарплату первого сотрудника: \n";
    std::cin >> a;

    std::cout << "Введите зарплату второго сотрудника: \n";
    std::cin >> b;

    std::cout << "Введите зарплату третьего сотрудника: \n";
    std::cin >> c;

    std::cout << "---Считаем---\n";

    if ((a > b) && (a > c) && (b >= c)) { //если две меньшие зп равны, то нет разницы, какую вычитать, поэтому >=
        std::cout << "Самая высокая зарплата в отделе: " << a << "рублей\n";
        diff = a - c;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }
    else if ((a > b) && (a > c) && (c >= b)) {
        std::cout << "Самая высокая зарплата в отделе: " << a << "рублей\n";
        diff = a - b;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }
    else if ((b > a) && (b > c) && (a >= c)) {
        std::cout << "Самая высокая зарплата в отделе: " << b << "рублей\n";
        diff = b - c;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }
    else if ((b > a) && (b > c) && (c >= a)) {
        std::cout << "Самая высокая зарплата в отделе: " << b << "рублей\n";
        diff = b - a;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }   
    else if ((c > a) && (c > b) && (a >= b)) {
        std::cout << "Самая высокая зарплата в отделе: " << c << "рублей\n";
        diff = c - b;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }
    else if ((c > a) && (c > b) && (b >= a)) {
        std::cout << "Самая высокая зарплата в отделе: " << c << "рублей\n";
        diff = c - a;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }
    else if ((a == b) && (a == c)) {
        std::cout << "Самая высокая зарплата в отделе: " << a << "рублей\n";
        diff = a - a;
        std::cout << "Разница между самой высокой и самой низкой зарплатой в отделе: " << diff << "рублей\n";
    }


    average = (a + b + c) / 3;
    std::cout << "Средняя зарплата в отделе: " << average << "рублей\n";
}


